name: "resnet50"
platform: "tensorflow_savedmodel"
max_batch_size: 128
input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [ 224, 224, 3 ]
  }
]
output [
  {
    name: "probabilities"
    data_type: TYPE_FP32
    dims: [ 1001 ]
  }
]
instance_group [
    {
        count: 1
    } 
]